# ColorOptions Methods

---
The ColorOptions type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetColorOptions|  Returns the current Revit instance's ColorOptions.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
ColorOptions Class
Autodesk.Revit.DB Namespace